data_generation/simulation_results/of/case_74/constant/pcb/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/pcb/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    empty
    {
        type            empty;
        physicalType    patch;
        inGroups        1(empty);
        nFaces          1592;
        startFace       1426;
    }
    pcb_to_component_4
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          32;
        startFace       3018;
        sampleMode      nearestPatchFace;
        sampleRegion    component_4;
        samplePatch     component_4_to_pcb;
    }
    pcb_to_component_2
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          32;
        startFace       3050;
        sampleMode      nearestPatchFace;
        sampleRegion    component_2;
        samplePatch     component_2_to_pcb;
    }
    pcb_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          170;
        startFace       3082;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_pcb;
    }
    pcb_to_component_0
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          66;
        startFace       3252;
        sampleMode      nearestPatchFace;
        sampleRegion    component_0;
        samplePatch     component_0_to_pcb;
    }
    pcb_to_component_3
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          22;
        startFace       3318;
        sampleMode      nearestPatchFace;
        sampleRegion    component_3;
        samplePatch     component_3_to_pcb;
    }
    pcb_to_component_1
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          8;
        startFace       3340;
        sampleMode      nearestPatchFace;
        sampleRegion    component_1;
        samplePatch     component_1_to_pcb;
    }
)

// ************************************************************************* //
