data_generation/simulation_results/of/case_74/constant/simParams
nIter 2000;
hComponent0 822.9445863338719;
hComponent1 1084.3697862641482;
hComponent2 1420.2151802526396;
hComponent3 1028.4473012176359;
hComponent4 1250.1426725579518;kComponent0 56.518395440018594;
kComponent1 32.23805031906285;
kComponent2 57.94381617530637;
kComponent3 73.79562465176879;
kComponent4 99.01639998408045;
tAmbient 300;
Ux 1.7020200319982246;
kPCB 0.29909657287925023;